<script setup lang="ts">
import Table from '@/components/ui/table/Table.vue'

type PProps = {
  details: object
}
</script>

<template>
  <div class="project-details">
    <h2 class="title">Детали проекта</h2>
    <div class="tables">
      <div class="table">
        <h3>Таблица Закупок</h3>
        <Table
          :columns="[
            'Номер',
            'Наименование',
            'Количество',
            'Цена за штуку',
            'Конечная цена',
            'Статус',
          ]"
          :rows="[
            ['1', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['2', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['3', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['4', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['5', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['6', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['7', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['8', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['9', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['10', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['11', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['12', 'Гвоздь', '56', '5', '280', 'Заказано'],
          ]"
        />
      </div>
      <div class="table">
        <h3>Таблица Материалов</h3>
        <Table
          :columns="[
            'Номер',
            'Наименование',
            'Объем',
            'Цена (кв.м)',
            'Итого',
            'Статус',
          ]"
          :rows="[
            ['1', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['2', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['3', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['4', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['5', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['6', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['7', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['8', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['9', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['10', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['11', 'Гвоздь', '56', '5', '280', 'Заказано'],
            ['12', 'Гвоздь', '56', '5', '280', 'Заказано'],
          ]"
        />
      </div>
    </div>
  </div>
</template>

<style scoped lang="scss">
.project {
  &-details {
    display: flex;
    flex-direction: column;
    gap: var(--space-xl);
    border-radius: var(--radius-lg);
    padding: var(--space-md);
    background-color: var(--fourth-color);

    .title {
      width: 100%;
      text-align: center;
    }
  }
}

.tables {
  display: flex;
  text-align: center;
  gap: var(--space-sm);
}

.table {
  width: 100%;
  display: flex;
  flex-direction: column;
  gap: var(--space-sm);
}
</style>
